#+TITLE: Digital Skills
#+AUTHOR: Christos Dimitrakakis
#+EMAIL:christos.dimitrakakis@unine.ch
#+LaTeX_HEADER: \newcommand \E {\mathop{\mbox{\ensuremath{\mathbb{E}}}}\nolimits}
#+LaTeX_HEADER: \newcommand\ind[1]{\mathop{\mbox{\ensuremath{\mathbb{I}}}}\left\{#1\right\}}
#+LaTeX_HEADER: \renewcommand \Pr {\mathop{\mbox{\ensuremath{\mathbb{P}}}}\nolimits}
#+LaTeX_HEADER: \newcommand \defn {\mathrel{\triangleq}}
#+LaTeX_HEADER: \newcommand \Reals {\mathbb{R}}
#+LaTeX_HEADER: \newcommand \Param {\Theta}
#+LaTeX_HEADER: \newcommand \param {\theta}
#+TAGS: activity advanced definition exercise homework project dataset example theory statistics plot code

*** Python variables												   :code:

 Numerical Python variables are very simple entities. Let us go through
 this is easy program for a warm-up.
 - x=value; assigns a value to a variable named x
 - print(); displays something in the terminal
 #+BEGIN_SRC python :results output
 x = 1 # a variable
 y = 2 # another variable
 print(x+y) # print the value of this variable sum
 x = y # assignment operation: now x has the same value as y
 print(x) #what would this value be?
 y = 3
 print(x) #is x changed?
 #+END_SRC
 #+RESULTS:
 : 3
 : 2
 : 2

*** Python lists													   :code:

 A slightly more compex object are python lists. A list can contain
 anything, and is so very flexible. It can contain numbers, strings,
 or arbitrary 'objects'.

Now check out the first part of the [[file:src/histograms/histogram.ipynb][Histogram example]].
For that we need one line of setup so we can plot stuff.
#+BEGIN_SRC python
import matplotlib.pyplot as plt # this is used for plotting
X=[0,1,0,0,0,0,1];  # list of coin tosses
plt.hist(X) # plot a histogram - this automatically splits everything into bins
#+END_SRC

In reality, the histogram function creates a so-called bar plot
#+BEGIN_SRC python
import matplotlib.pyplot as plt # this is used for plotting
X=[0,1,0,0,0,0,1];  # list of coin tosses
plt.bar(["heads","tails"], [sum(X), len(X) - sum(X)]) # do a bar plot!
#+END_SRC

#+RESULTS:

The following source creates a list of four numbers and returns one element.  Things to unpack here:
- *x[i]* returns the *(i+1)-th* element: we start counting *from 0*
- the *return* statement sends a value back to the whatever started
  the python program: in this case this .org file.
#+BEGIN_SRC python :results value
x = [1, 2, 3, 4]
return x[3] # returns the last element of the list
#+END_SRC

#+RESULTS:
: 4




The following program assigns arrays-values to variables. Now x, y are both lists.
 #+BEGIN_SRC python
 x = [1, 2, 3, 4]
 y = [-1, -2]
 x = y # assignment operation: now x is just a different name for y
 y[0] = 1 # modify the 0th element of y
 return x # what would the value of x be?
 #+END_SRC

 #+RESULTS:
 | 1 | -2 |

 Lists are different in one respect: when we assign one list name to
 another, this does not copy any data. Both names refer to the same
 data. Consequently, if we change the data, it changes for both
 variable names.
 The way to avoid that is to use the *copy()* function.
 #+BEGIN_SRC python
 x = [1, 2, 3, 4]
 y = [-1, -2]
 x = y.copy() # copy operation: now x has a copy of y's data
 y[0] = 1 # modify the 0th element of y
 return x # what would the value of x be?
 #+END_SRC

 #+RESULTS:
 | -1 | -2 |

*** Numpy arrays											  :advanced:code:

 Because lists are very flexible, they are a bit slow. A special type
 of object, an array, is used to handle lists of numbers. This is not
 defined in basic python, but only in one module called /numpy/. Even
 though basic Python has only a few commands, it has many modules that
 extend the language to perform complex tasks without having to code
 everything from scratch.

 #+BEGIN_SRC python
 import numpy as np
 x = np.array([1, 2, 3, 4])
 y = np.array([-1, -2])
 x = y # assignment operation: 
 y[0] = 1
 return x
 #+END_SRC

 #+RESULTS:
 | 1 | -2 |

*** Randomness												  :code:activity:
*Random algorithms using coins*.
 #+BEGIN_SRC python
   y = 0 # y is a variable, with the value zero currently
   import numpy as np # this library has many useful functions
   x = np.random.choice(100) # x takes values 'randomly'. It is a 'random variable'.
   return x # let's see what value it takes
 #+END_SRC
 #+RESULTS:
 : 31

*Uncertainty vs randomness: coin-flipping experiment*
	 1. Everybody flips a coin 10 times.
	 2. Record how many heads or tails you have.
	 3. Then record how you threw the coin and what coin it was.
	 4. Discuss if the coin is really random.
	 5. What is the distribution of coin throws for the first throw?
	 6. What is the distribution of recorded coin biases? Why do some coins appear more biased than others?
	 7. Does it make sense to aggregate all the results? What does that assume?

In the context of experiment design and data analysis, it is very
common to have conditions like those in this example.  Even though we
wish there was such a thing as the 'repeated experiment', in practice
it never is repeated. There is always some varying factor.


*Pseudo-random numbers*

 Let us now repeat the experiment with data generated via a computer.
 #+BEGIN_SRC python
 # here is a default way to generate 'random' numbers
 import random
 X = random.choices([0, 1], k=10) # uniformly choose 10 times between 0 and 1.
 plt.hist(X) # everytime we run these commands, we get a different proportion
 #+END_SRC

 #+RESULTS:

 This python code is completely deterministic. A complicated
 calculation is used to generate the next 'random' number from the
 previous one. Consider this example:
 #+BEGIN_SRC python
 import random
 seed(5) #this sets the 'state' of the random number generating machine
 print(random.uniform(0,1)) # the random number is a function of the state
 print(random.uniform(0,1)) # the state changes after we generate a new number
 print(random.uniform(0,1))
 seed(5) # when we reset the state, we get the same sequence of numbers
 print(random.uniform(0,1)) #
 print(random.uniform(0,1))
 print(random.uniform(0,1))
 #+END_SRC python

 For cryptographically strong random numbers you need to use the secrets module:
 #+BEGIN_SRC python
 import secrets
 secrets.choice(range(100))
 #+END_SRC

*Physical sources of randomness*

 Let's go back to throwing coins now. Coins are completely
 deterministic.  Whenever we have a specific coin to throw in the air,
 there are two things we do not know. The first is which side the coin
 will land on. Why is that? The second is uncertainty about the coin
 bias: is the probability of landing heads exactly 50%? How can we
 quantify this? What does it depend on? Discuss in class.

 What physical source of randomness can we use instead of coins?

***** Generating a Bernoulli random variable.                 :activity:code:

In python, there are procedures for generating data from many types of
random variables. However, all such methods for generating random
numbers are not truly random. They rely on something called a
pseudorandom number generator. The values output by this generator are
then /transformed/ so as to become similar to the random variable we
want.

1. Let us start by throwing a 10-sided die. How do you generate a
   Bernoulli random variable with $\theta = 0.6$ from the outcomes of
   the dice throw?

2. Now let us consider the following python code, which generates
   values from a Bernoulli random variable.
#+BEGIN_SRC python
import numpy as np
return np.random.choice(2,p=[0.6, 0.4])
#+END_SRC

#+RESULTS:
: 0

   Let us replicate it through a distribution of uniform randomv variables in $[0,1]$.
#+BEGIN_SRC python
import numpy as np
x = np.random.uniform() # returns a uniformly generated number in [0,1). 
if x < 0.6:
  return 1
else:
  return 0
#+END_SRC

#+RESULTS:
: 1


